src/InformationRegisters/НастройкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонОбследований</Name>
					<Comment>Основной шаблон обследований</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПриемНесколькихПациентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяРучнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/РольПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РольПользователя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управляющий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйВрач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Врач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ассистент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистратура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СестраХозяйка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистраторБазыДанных</Name>
					<Comment>Администратор базы данных</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
					<Comment>Упрощенная </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ОбъектыНалогообложенияПоУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ОбъектыНалогообложенияПоУСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКасс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКасс</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КассаПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперационнаяКасса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресТолькоРоссийский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещатьВводНекорректного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочноеПоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонCДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/НачалоРаботыСПрограммойПереопределяемый/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДозаполнитьПараметрыОткрытияФормы(ПараметрыОткрытия, ПараметрыНачалаРаботы) Экспорт
	
	//ВидыБизнеса = Новый ТаблицаЗначений;
	//ВидыБизнеса.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число"));
	//ВидыБизнеса.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	//ВидыБизнеса.Колонки.Добавить("Синонимы", Новый ОписаниеТипов("Строка"));
	//
	//МакетКлассификаторВидовБизнеса = ПолучитьОбщийМакет("КлассификаторВидовБизнеса").ПолучитьТекст();
	//
	//ЧтениеXML = Новый ЧтениеXML;
	//ЧтениеXML.УстановитьСтроку(МакетКлассификаторВидовБизнеса);
	//
	//Пока ЧтениеXML.Прочитать() Цикл
	//	
	//	Если ЧтениеXML.Имя = "biz" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
	//		
	//		Наименование = ЧтениеXML.ПолучитьАтрибут("name");
	//		Идентификатор = ЧтениеXML.ПолучитьАтрибут("id");
	//		
	//		НоваяСтрока = ВидыБизнеса.Добавить();
	//		НоваяСтрока.Наименование = Наименование;
	//		НоваяСтрока.Идентификатор = Число(Идентификатор);
	//		
	//	ИначеЕсли ЧтениеXML.Имя = "biz" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
	//		
	//		Продолжить;
	//		
	//	ИначеЕсли ЧтениеXML.Имя = "synonym" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
	//		
	//		ЧтениеXML.Прочитать();
	//		НоваяСтрока.Синонимы = НоваяСтрока.Синонимы + " " + ЧтениеXML.Значение;
	//		
	//	ИначеЕсли ЧтениеXML.Имя = "synonym" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
	//		
	//		Продолжить;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//ПараметрыОткрытия.Вставить("ВидыБизнесаАдресВХранилище", ПоместитьВоВременноеХранилище(ВидыБизнеса));
	//
КонецПроцедуры

Процедура ОбработкаЗакрытияФормыНачалаРаботы(ЗначенияРеквизитов, ПараметрыНачалаРаботы, ОбработкаЗавершена) Экспорт
	
	ПараметрыРаботыКлиента = ПараметрыНачалаРаботы.ПараметрыРаботыКлиента;
	
	ОбновитьПользователяИДругиеДанные(ЗначенияРеквизитов, ПараметрыРаботыКлиента);
	
	//ВыполнитьЗаполнениеПоВидуБизнеса(ЗначенияРеквизитов, ПараметрыРаботыКлиента);
	
	//ОбновитьЗаписатьОрганизации(ЗначенияРеквизитов, ПараметрыРаботыКлиента);
		
	ЗафиксироватьОкончаниеПервогоВходаВПрограмму();
	
	ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#Область ПользователиИКонтактнаяИнформация

// Дублируем метод из УправлениеКонтактнойИнформацией
Процедура ЗаполнитьРеквизитыТабличнойЧастиДляАдресаЭлектроннойПочты(СтрокаТабличнойЧасти, Источник)
	
	Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(СтрокаТабличнойЧасти.Представление, Ложь);
	
	Если Результат.Количество() > 0 Тогда
		СтрокаТабличнойЧасти.АдресЭП = Результат[0].Адрес;
		
		Поз = СтрНайти(СтрокаТабличнойЧасти.АдресЭП, "@");
		Если Поз <> 0 Тогда
			СтрокаТабличнойЧасти.ДоменноеИмяСервера = Сред(СтрокаТабличнойЧасти.АдресЭП, Поз+1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПользователяИДругиеДанные(ЗначенияРеквизитов, ПараметрыРаботыКлиента)
	Перем ПользовательСсылка;
	
	Если НЕ ЗначенияРеквизитов.Свойство("Пользователь", ПользовательСсылка)
		ИЛИ НЕ ЗначениеЗаполнено(ПользовательСсылка) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НачатьТранзакцию(); 
	
	СотрудникОбъект = Справочники.Сотрудники.СоздатьЭлемент();
	
	// Доступно только в локальном режиме
	СотрудникОбъект.Наименование = ЗначенияРеквизитов.ПользовательИмя;
	
	ОписаниеПользователяИБ = Новый Структура;
	ОписаниеПользователяИБ.Вставить("Действие",					"Записать");
	ОписаниеПользователяИБ.Вставить("Имя",						ЗначенияРеквизитов.ПользовательИмя);
	ОписаниеПользователяИБ.Вставить("ПолноеИмя",				ЗначенияРеквизитов.ПользовательИмя);   
	
	ДоступныеРоли = Новый Массив;
	ДоступныеРоли.Добавить(Метаданные.Роли.ПолныеПрава.Имя);
	
	Если НЕ ПараметрыРаботыКлиента.РазделениеВключено Тогда
		
		ОписаниеПользователяИБ.Вставить("Пароль", 					ЗначенияРеквизитов.ПользовательПароль);
		ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная",Истина);
		ОписаниеПользователяИБ.Вставить("ПарольУстановлен", 		Истина);
		ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора",	Истина);
		
		ДоступныеРоли.Добавить(Метаданные.Роли.АдминистраторСистемы.Имя);
		//ДоступныеРоли.Добавить(Метаданные.Роли.ИспользованиеЛичногоКабинета.Имя);
		
	КонецЕсли;
	
	ОписаниеПользователяИБ.Вставить("Роли", ДоступныеРоли);
	
	СотрудникОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	СотрудникОбъект.ДополнительныеСвойства.Вставить("СозданиеАдминистратора", НСтр("ru = 'Создание первого администратора.'"));
	СотрудникОбъект.Роль = Перечисления.РольПользователя.АдминистраторБазыДанных;
	//ПользовательОбъект.Служебный = Ложь;
	//ПользовательОбъект.ЭтоПользовательИБ = Истина;
	СотрудникОбъект.ИдентификаторПользователяИБ = Новый УникальныйИдентификатор();
	СотрудникОбъект.Имя = ЗначенияРеквизитов.ПользовательИмя;
	
	Если НЕ ПустаяСтрока(ЗначенияРеквизитов.ПользовательEmail) Тогда
		
		ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
		
		МассивСтрок = СотрудникОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ВидКИ));
		
		СтрокаКИ = ?(МассивСтрок.Количество() = 0,СотрудникОбъект.КонтактнаяИнформация.Добавить(), МассивСтрок[0]);
		СтрокаКИ.Вид = ВидКИ;
		СтрокаКИ.Представление = ЗначенияРеквизитов.ПользовательEmail;		
		СтрокаКИ.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению(СтрокаКИ.Представление, СтрокаКИ.Вид);
		СтрокаКИ.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СтрокаКИ.Представление, СтрокаКИ.Вид);
		СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		
		ЗаполнитьРеквизитыТабличнойЧастиДляАдресаЭлектроннойПочты(СтрокаКИ, СотрудникОбъект);
		
	КонецЕсли;
	
		
	Если НЕ ПустаяСтрока(ЗначенияРеквизитов.ПользовательТелефон) Тогда
		
		ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
		
		МассивСтрок = СотрудникОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ВидКИ));
		
		СтрокаКИ = ?(МассивСтрок.Количество() = 0,СотрудникОбъект.КонтактнаяИнформация.Добавить(), МассивСтрок[0]);
		СтрокаКИ.Вид = ВидКИ;
		СтрокаКИ.Представление = ЗначенияРеквизитов.ПользовательТелефон;		
		СтрокаКИ.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению(СтрокаКИ.Представление, СтрокаКИ.Вид);
		СтрокаКИ.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СтрокаКИ.Представление, СтрокаКИ.Вид);
		СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		
	КонецЕсли;
	
	ДолжностьДиректора = Справочники.Должности.СоздатьЭлемент();
	ДолжностьДиректора.Наименование = "Директор";
	ДолжностьДиректора.ОтображатьВЖурналеПредварительнойЗаписи = Ложь;
	ДолжностьДиректора.Записать();
		 
	Если ТипЗнч(СотрудникОбъект) = Тип("СправочникОбъект.Сотрудники") И Не ЗначениеЗаполнено(СотрудникОбъект.Должность) Тогда 
		СотрудникОбъект.Должность = ДолжностьДиректора.Ссылка;
	КонецЕсли;
	
	ОсновнаяОрганизация = Справочники.Организации.СоздатьЭлемент();
	
	ОсновнаяОрганизация.Наименование = ЗначенияРеквизитов.НазваниеСалона;
	ОсновнаяОрганизация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая;
	ОсновнаяОрганизация.ОбъектНалогообложения = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы;
	
	ОсновнаяОрганизация.Записать();
	
	ОсновнойСклад = Справочники.Склады.СоздатьЭлемент();
    ОсновнойСклад.Наименование = "Основной склад";
	ОсновнойСклад.Записать();
	
	ОсновнаяКасса = Справочники.Кассы.СоздатьЭлемент();
    ОсновнаяКасса.Наименование = "Основная касса";
	ОсновнаяКасса.ТипКассы = Перечисления.ТипыКасс.ОперационнаяКасса;
	ОсновнаяКасса.ИспользоватьБезПодключенияОборудования = Истина;
	ОсновнаяКасса.Склад = ОсновнойСклад.Ссылка;
	ОсновнаяКасса.Записать();

	// Заполнение структурной единицы, ставки НДС и времени работы.
	ВыборкаСтруктурныхЕдиниц = Справочники.СтруктурныеЕдиницы.Выбрать();
	
	Если ВыборкаСтруктурныхЕдиниц.Следующий() Тогда
		ОсновнаяСтруктурнаяЕдиница = ВыборкаСтруктурныхЕдиниц.ПолучитьОбъект();
	Иначе
		ОсновнаяСтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.СоздатьЭлемент();
	КонецЕсли;
	
	ОсновнаяСтруктурнаяЕдиница.Наименование = ЗначенияРеквизитов.НазваниеСалона;
	ОсновнаяСтруктурнаяЕдиница.Организация = ОсновнаяОрганизация.Ссылка;
	ОсновнаяСтруктурнаяЕдиница.ОсновнаяКасса = ОсновнаяКасса.Ссылка;
	ОсновнаяСтруктурнаяЕдиница.ОсновнойСклад = ОсновнойСклад.Ссылка;
	ОсновнаяСтруктурнаяЕдиница.ВидЦенРеализации = Справочники.ВидыЦен.Розничная;
	
	// Запись расписания дней в табличную часть.
	ОсновнаяСтруктурнаяЕдиница.РасписаниеРаботы.Очистить();
	
	Для ИНД = 1 ПО 7 Цикл
		ДеньД = ОсновнаяСтруктурнаяЕдиница.РасписаниеРаботы.Добавить();
		ДеньД.Активность = Истина;
		ДеньД.ДеньНедели = Дата("2001010"+Строка(ИНД));
		ДеньД.НачалоРаботы = ЗначенияРеквизитов.ВремяНачалаРаботы;
		ДеньД.ОкончаниеРаботы = ЗначенияРеквизитов.ВремяОкончанияРаботы;
	КонецЦикла;                   
		
	//Если ОсновнаяСтруктурнаяЕдиница.РасписаниеРаботы.Количество() = 7 Тогда
	//	СтрокаРасписание = ОсновнаяСтруктурнаяЕдиница.РасписаниеРаботы.Добавить();
	//	СтрокаРасписание.НачалоРаботы    = ЗначенияРеквизитов.ВремяНачалаРаботы;
	//	СтрокаРасписание.ОкончаниеРаботы = ЗначенияРеквизитов.ВремяОкончанияРаботы;
	//КонецЕсли;
	
	ОсновнаяСтруктурнаяЕдиница.Записать();
	
	//ПервыйКабинет = Справочники.Помещения.СоздатьЭлемент();
	//ПервыйКабинет.ОтображатьВРасписанииЗанятий = Истина;
	//ПервыйКабинет.СтруктурнаяЕдиница = ОсновнаяСтруктурнаяЕдиница.Ссылка;
	//ПервыйКабинет.Записать(); 
	
	ОсновнаяКасса.СтруктурнаяЕдиница = ОсновнаяСтруктурнаяЕдиница.Ссылка;
	ОсновнаяКасса.Записать();
	
	ОсновнойСклад.СтруктурнаяЕдиница = ОсновнаяСтруктурнаяЕдиница.Ссылка;
	ОсновнойСклад.Записать();
		
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.СтавкаНДС) Тогда 
		Мета = Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления.Найти("БезНДС");
		СтавкаНДС = Перечисления.СтавкиНДС[СтрЗаменить(ЗначенияРеквизитов.СтавкаНДС, " ", "")];
		ОрганизацияОсновнойСЕ = ОсновнаяСтруктурнаяЕдиница.Организация; 
		Если ЗначениеЗаполнено(ОрганизацияОсновнойСЕ) Тогда 
			ОрганизацияОбъект = ОрганизацияОсновнойСЕ.ПолучитьОбъект();
			ОрганизацияОбъект.СтавкаНДС = СтавкаНДС;
			ОрганизацияОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
	// Страна учета
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.СтранаУчета) Тогда
		СтранаУч = Справочники.СтраныМира.НайтиПоНаименованию(ЗначенияРеквизитов.СтранаУчета);
		Если СтранаУч <> Неопределено Тогда			
			СтранаУчета = СтранаУч;
		Иначе
			СтранаУчета = Справочники.СтраныМира.Россия;
		КонецЕсли;
		
		Константы.СтранаУчета.Установить(СтранаУчета);
		
		Константы.ВалютаУчета.Установить(Справочники.Валюты.НайтиПоКоду(Число(СтранаУчета.Код)));
		
	КонецЕсли;	

	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СотрудникОбъект, Ложь, Истина);
	
	Если ПараметрыРаботыКлиента.РазделениеВключено Тогда
		
		ПользовательCистемы = ПользовательСсылка.ПолучитьОбъект();

	Иначе

		ПользовательCистемы = Справочники.Пользователи.СоздатьЭлемент();
		
	КонецЕсли;
	
	ПользовательCистемы.Наименование = ЗначенияРеквизитов.ПользовательИмя;
	ПользовательCистемы.ИдентификаторПользователяИБ = СотрудникОбъект.ИдентификаторПользователяИБ;
	ПользовательCистемы.РольПользователя = Перечисления.РольПользователя.Руководитель;
	ПользовательCистемы.Сотрудник = СотрудникОбъект.Ссылка;
	ПользовательCистемы.ЭтоПользовательИБ = Истина;
	ПользовательCистемы.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	ПользовательCистемы.ДополнительныеСвойства.Вставить("СозданиеАдминистратора", НСтр("ru = 'Создание первого администратора.'"));
		
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПользовательCистемы, Ложь, Истина);
	
	Если ПользовательCистемы.ИдентификаторПользователяИБ <> СотрудникОбъект.ИдентификаторПользователяИБ Тогда
		СотрудникОбъект.ИдентификаторПользователяИБ = ПользовательCистемы.ИдентификаторПользователяИБ;
		СотрудникОбъект.Записать();
	КонецЕсли;
	
	Если СотрудникОбъект.ДоступныеСтруктурныеЕдиницы.Количество() = 0 Тогда 
		НаборНастройкиСотрудников = РегистрыСведений.НастройкиСотрудников.СоздатьМенеджерЗаписи();
		НаборНастройкиСотрудников.Сотрудник = СотрудникОбъект.Ссылка; 
		НаборНастройкиСотрудников.СтруктурнаяЕдиница = ОсновнаяСтруктурнаяЕдиница.Ссылка;
		НаборНастройкиСотрудников.Записать();
	КонецЕсли;

	ЗафиксироватьТранзакцию();
	
	Если ОсновнаяСтруктурнаяЕдиница <> Неопределено и ЗначениеЗаполнено(ОсновнаяСтруктурнаяЕдиница.Ссылка) Тогда
		ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница = ОсновнаяСтруктурнаяЕдиница.Ссылка;
	КонецЕсли;
	
		
КонецПроцедуры

//Процедура ОбновитьЗаписатьОрганизации(ЗначенияРеквизитов, ПараметрыРаботыКлиента)
//	
//	// ЗначенияРеквизитов.Организации.Выгрузить() - в толстом приводит к ошибке
//	ТаблицаОрганизаций = Обработки.НачалоРаботыСПрограммой.Создать().Организации.Выгрузить(); 
//	
//	КоличествоОрганизаций = ЗначенияРеквизитов.Организации.Количество();
//	Для Счетчик = 0 По КоличествоОрганизаций - 1 Цикл
//		
//		ЗаполнитьЗначенияСвойств(ТаблицаОрганизаций.Добавить(), ЗначенияРеквизитов.Организации[Счетчик]);
//		
//	КонецЦикла;
//	
//	Если КоличествоОрганизаций > 1 Тогда
//		
//		Константы.ИспользоватьНесколькоОрганизаций.Установить(Истина);
//		Константы.НеИспользоватьНесколькоОрганизаций.Установить(Ложь);
//		
//	КонецЕсли;
//	
//	НачатьТранзакцию();
//	Для каждого СтрокаОрганизации Из ТаблицаОрганизаций Цикл
//		
//		ОрганизацияОбъект = СтрокаОрганизации.Ссылка.ПолучитьОбъект();
//		
//		Если ОрганизацияОбъект = Неопределено Тогда
//			
//			ОрганизацияОбъект = Справочники.Организации.СоздатьЭлемент();
//			ОрганизацияОбъект.УстановитьСсылкуНового(СтрокаОрганизации.Ссылка);
//			
//			ОрганизацияОбъект.ПроизводственныйКалендарь = УправлениеНебольшойФирмойСервер.ПолучитьКалендарьПоПроизводственномуКалендарюРФ(); 
//			ОрганизацияОбъект.СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС(18);
//			
//		КонецЕсли;
//		
//		ЗаполнитьЗначенияСвойств(ОрганизацияОбъект, СтрокаОрганизации);
//		
//		Если ОрганизацияОбъект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
//			
//			ОрганизацияОбъект.ИспользуетсяОтчетность = (СтрокаОрганизации.ЕстьУСН ИЛИ СтрокаОрганизации.ЕстьЕНВД);
//			
//			ФизическоеЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
//			ФизическоеЛицо.Наименование = СтрокаОрганизации.Фамилия
//				+ ?(ПустаяСтрока(СтрокаОрганизации.Имя), "", " " + СтрокаОрганизации.Имя)
//				+ ?(ПустаяСтрока(СтрокаОрганизации.Отчество), "", " " + СтрокаОрганизации.Отчество);
//			ФизическоеЛицо.Записать();
//			
//			ОрганизацияОбъект.ФизическоеЛицо = ФизическоеЛицо.Ссылка;
//			
//			МенеджерЗаписиФизЛица = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
//			ЗаполнитьЗначенияСвойств(МенеджерЗаписиФизЛица, СтрокаОрганизации, "Фамилия, Имя, Отчество");
//			МенеджерЗаписиФизЛица.Период = '19800101';
//			МенеджерЗаписиФизЛица.ФизЛицо = ФизическоеЛицо.Ссылка;
//			МенеджерЗаписиФизЛица.Записать(Истина);
//			
//			МенеджерЗаписиДокументыФизЛиц = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
//			МенеджерЗаписиДокументыФизЛиц.Период = '19800101';
//			МенеджерЗаписиДокументыФизЛиц.ФизЛицо = ФизическоеЛицо.Ссылка;
//			МенеджерЗаписиДокументыФизЛиц.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ;
//			МенеджерЗаписиДокументыФизЛиц.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
//			МенеджерЗаписиДокументыФизЛиц.Записать(Истина);
//			
//		КонецЕсли;
//		
//		МенеджерЗаписи = РегистрыСведений.СистемыНалогообложенияОрганизаций.СоздатьМенеджерЗаписи();
//		МенеджерЗаписи.Период = '20000101';
//		МенеджерЗаписи.Организация = СтрокаОрганизации.Ссылка;
//		МенеджерЗаписи.ПлательщикЕНВД = СтрокаОрганизации.ЕстьЕНВД;
//		МенеджерЗаписи.ПрименяетсяПатент = СтрокаОрганизации.ЕстьПатент;
//		
//		Если СтрокаОрганизации.ЕстьУСН = Истина Тогда
//			
//			МенеджерЗаписи.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная;
//			МенеджерЗаписи.ПлательщикУСН = Истина;
//			МенеджерЗаписи.ОбъектНалогообложения = СтрокаОрганизации.ВидыОбъектовНалогообложения;
//			МенеджерЗаписи.СтавкаНалога = СтрокаОрганизации.СтавкаНалога;
//			
//		Иначе
//			
//			МенеджерЗаписи.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая;
//			МенеджерЗаписи.ПлательщикУСН = Ложь;
//			
//		КонецЕсли;
//		
//		Попытка
//			
//			ОрганизацияОбъект.Записать();
//			МенеджерЗаписи.Записать(Истина);
//			
//		Исключение
//			
//			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
//			ЗаписьЖурналаРегистрации("Стартовое окно", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Организации, ТекстОшибки, );
//			
//			ВызватьИсключение ОписаниеОшибки();
//			
//			ОтменитьТранзакцию();
//			
//		КонецПопытки;
//		
//	КонецЦикла;
//	
//	ЗафиксироватьТранзакцию();
//	
//КонецПроцедуры

Процедура ЗафиксироватьОкончаниеПервогоВходаВПрограмму()
	
	Константы.ДатаПервогоВходаВСистему.Установить(ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
